martijnvwezel/3-phase-muino-sensor/5.ESP32/sdkconfig.defaults
# Set device
CONFIG_IDF_TARGET="esp32s3"

# Enable ULP
CONFIG_ULP_COPROC_ENABLED=y
CONFIG_ULP_COPROC_TYPE_RISCV=y
CONFIG_ULP_COPROC_RESERVE_MEM=4096
# Set log level to Warning to produce clean output
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_BOOTLOADER_LOG_LEVEL=2
CONFIG_LOG_DEFAULT_LEVEL_WARN=y
CONFIG_LOG_DEFAULT_LEVEL=2

#CONFIG_ESP32S2_ULP_COPROC_RISCV=y